Ran Plan for 3 projects:

1. project: `setof-commerce-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `setof-commerce-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `setof-commerce-ecs-web-api-legacy-prod` dir: `terraform/ecs-web-api-legacy` workspace: `default`
---

### 1. project: `setof-commerce-ecr-prod` dir: `terraform/ecr` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/setof-commerce/6/default/terraform/ecr": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Upgrading modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_legacy_api...
- ecr_legacy_api in .terraform/modules/ecr_legacy_api/terraform/modules/ecr
- ecr_legacy_api.tags in .terraform/modules/ecr_legacy_api/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_web_api...
- ecr_web_api in .terraform/modules/ecr_web_api/terraform/modules/ecr
- ecr_web_api.tags in .terraform/modules/ecr_web_api/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_web_api_admin...
- ecr_web_api_admin in .terraform/modules/ecr_web_api_admin/terraform/modules/ecr
- ecr_web_api_admin.tags in .terraform/modules/ecr_web_api_admin/terraform/modules/common-tags

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.0.0, ~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
╷
│ Error: Failed to update dependency lock file
│ 
│ Error while writing new dependency lock information to .terraform.lock.hcl:
│ cannot create temporary file to update .terraform.lock.hcl: open
│ ./.terraform.lock.hcl2561460959: no such file or directory.
╵


```
</details>

---
### 2. project: `setof-commerce-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lb.web_api will be destroyed
  # (because aws_lb.web_api is not in configuration)
- resource "aws_lb" "web_api" {
      - arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/setof-commerce-alb-prod/594f87ad7a24c4df" -> null
      - arn_suffix                                                   = "app/setof-commerce-alb-prod/594f87ad7a24c4df" -> null
      - client_keep_alive                                            = 3600 -> null
      - desync_mitigation_mode                                       = "defensive" -> null
      - dns_name                                                     = "setof-commerce-alb-prod-1330483282.ap-northeast-2.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                                   = false -> null
      - enable_cross_zone_load_balancing                             = true -> null
      - enable_deletion_protection                                   = false -> null
      - enable_http2                                                 = true -> null
      - enable_tls_version_and_cipher_suite_headers                  = false -> null
      - enable_waf_fail_open                                         = false -> null
      - enable_xff_client_port                                       = false -> null
      - enable_zonal_shift                                           = false -> null
      - id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/setof-commerce-alb-prod/594f87ad7a24c4df" -> null
      - idle_timeout                                                 = 60 -> null
      - internal                                                     = false -> null
      - ip_address_type                                              = "ipv4" -> null
      - load_balancer_type                                           = "application" -> null
      - name                                                         = "setof-commerce-alb-prod" -> null
      - preserve_host_header                                         = false -> null
      - security_groups                                              = [
          - "sg-010616513328b5acc",
        ] -> null
      - subnets                                                      = (sensitive value) -> null
      - tags                                                         = {
          - "Lifecycle"    = "production"
          - "ManagedBy"    = "terraform"
          - "Name"         = "setof-commerce-alb-prod"
          - "cost_center"  = "engineering"
          - "data_class"   = "internal"
          - "environment"  = "prod"
          - "owner"        = "platform@ryuqqq.com"
          - "project"      = "setof-commerce"
          - "service_name" = "setof-commerce-web-api"
          - "team"         = "platform-team"
        } -> null
      - tags_all                                                     = {
          - "Environment"  = "prod"
          - "Lifecycle"    = "production"
          - "ManagedBy"    = "terraform"
          - "Name"         = "setof-commerce-alb-prod"
          - "Project"      = "setof-commerce"
          - "cost_center"  = "engineering"
          - "data_class"   = "internal"
          - "environment"  = "prod"
          - "owner"        = "platform@ryuqqq.com"
          - "project"      = "setof-commerce"
          - "service_name" = "setof-commerce-web-api"
          - "team"         = "platform-team"
        } -> null
      - vpc_id                                                       = "vpc-0f162b9e588276e09" -> null
      - xff_header_processing_mode                                   = "append" -> null
      - zone_id                                                      = "ZWKZPGTI48KDX" -> null
        # (3 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - subnet_mapping {
          - subnet_id            = "subnet-0bd2fc282b0fb137a" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0c8c0ad85064b80bb" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.http will be destroyed
  # (because aws_lb_listener.http is not in configuration)
- resource "aws_lb_listener" "http" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/setof-commerce-alb-prod/594f87ad7a24c4df/d08f6e2d0b76ff11" -> null
      - id                                                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/setof-commerce-alb-prod/594f87ad7a24c4df/d08f6e2d0b76ff11" -> null
      - load_balancer_arn                                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/setof-commerce-alb-prod/594f87ad7a24c4df" -> null
      - port                                                                = 80 -> null
      - protocol                                                            = "HTTP" -> null
      - routing_http_response_server_enabled                                = true -> null
      - tags                                                                = {} -> null
      - tags_all                                                            = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "setof-commerce"
        } -> null
        # (11 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - type             = "redirect" -> null
            # (1 unchanged attribute hidden)

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # aws_lb_listener.https will be destroyed
  # (because aws_lb_listener.https is not in configuration)
- resource "aws_lb_listener" "https" {
      - arn                                                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/setof-commerce-alb-prod/594f87ad7a24c4df/9eb03edc69fde06d" -> null
      - certificate_arn                                                       = (sensitive value) -> null
      - id                                                                    = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/setof-commerce-alb-prod/594f87ad7a24c4df/9eb03edc69fde06d" -> null
      - load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/setof-commerce-alb-prod/594f87ad7a24c4df" -> null
      - port                                                                  = 443 -> null
      - protocol                                                              = "HTTPS" -> null
      - routing_http_response_server_enabled                                  = true -> null
      - ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> null
      - tags                                                                  = {} -> null
      - tags_all                                                              = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "setof-commerce"
        } -> null
        # (18 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/setof-commerce-web-api-tg-prod/6d8e92520bb23eb8" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.web_api will be destroyed
  # (because aws_lb_target_group.web_api is not in configuration)
- resource "aws_lb_target_group" "web_api" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/setof-commerce-web-api-tg-prod/6d8e92520bb23eb8" -> null
      - arn_suffix                         = "targetgroup/setof-commerce-web-api-tg-prod/6d8e92520bb23eb8" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/setof-commerce-web-api-tg-prod/6d8e92520bb23eb8" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/setof-commerce-alb-prod/594f87ad7a24c4df",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "setof-commerce-web-api-tg-prod" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Name"         = "setof-commerce-web-api-tg-prod"
          - "cost_center"  = "engineering"
          - "data_class"   = "internal"
          - "environment"  = "prod"
          - "owner"        = "platform@ryuqqq.com"
          - "project"      = "setof-commerce"
          - "service_name" = "setof-commerce-web-api"
          - "team"         = "platform-team"
        } -> null
      - tags_all                           = {
          - "Environment"  = "prod"
          - "ManagedBy"    = "terraform"
          - "Name"         = "setof-commerce-web-api-tg-prod"
          - "Project"      = "setof-commerce"
          - "cost_center"  = "engineering"
          - "data_class"   = "internal"
          - "environment"  = "prod"
          - "owner"        = "platform@ryuqqq.com"
          - "project"      = "setof-commerce"
          - "service_name" = "setof-commerce-web-api"
          - "team"         = "platform-team"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = (sensitive value) -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/actuator/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # aws_route53_record.web_api will be destroyed
  # (because aws_route53_record.web_api is not in configuration)
- resource "aws_route53_record" "web_api" {
      - fqdn                             = "commerce.set-of.com" -> null
      - id                               = "Z104656329CL6XBYE8OIJ_commerce.set-of.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "commerce.set-of.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = (sensitive value) -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "setof-commerce-alb-prod-1330483282.ap-northeast-2.elb.amazonaws.com" -> null
          - zone_id                = "ZWKZPGTI48KDX" -> null
        }
    }

  # aws_security_group.alb will be destroyed
  # (because aws_security_group.alb is not in configuration)
- resource "aws_security_group" "alb" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-010616513328b5acc" -> null
      - description            = "Security group for ALB" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-010616513328b5acc" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP for redirect"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS from anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "setof-commerce-alb-sg-prod" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Lifecycle"    = "production"
          - "ManagedBy"    = "terraform"
          - "Name"         = "setof-commerce-alb-sg-prod"
          - "cost_center"  = "engineering"
          - "data_class"   = "internal"
          - "environment"  = "prod"
          - "owner"        = "platform@ryuqqq.com"
          - "project"      = "setof-commerce"
          - "service_name" = "setof-commerce-web-api"
          - "team"         = "platform-team"
        } -> null
      - tags_all               = {
          - "Environment"  = "prod"
          - "Lifecycle"    = "production"
          - "ManagedBy"    = "terraform"
          - "Name"         = "setof-commerce-alb-sg-prod"
          - "Project"      = "setof-commerce"
          - "cost_center"  = "engineering"
          - "data_class"   = "internal"
          - "environment"  = "prod"
          - "owner"        = "platform@ryuqqq.com"
          - "project"      = "setof-commerce"
          - "service_name" = "setof-commerce-web-api"
          - "team"         = "platform-team"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecs_security_group.aws_security_group.this must be replaced
+/- resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-08a96a3c690096c70" -> (known after apply)
      ~ description            = "Security group for web-api ECS tasks" -> "Security group for web-api ECS tasks - VPC internal only" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-08a96a3c690096c70" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "From ALB only"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-010616513328b5acc",
                ]
              - self             = false
              - to_port          = 8080
            },
        ] -> (known after apply)
        name                   = "setof-commerce-web-api-sg-prod"
      + name_prefix            = (known after apply)
      ~ owner_id               = "646886795421" -> (known after apply)
      ~ tags                   = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          ~ "Description" = "Security group for web-api ECS tasks" -> "Security group for web-api ECS tasks - VPC internal only"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "setof-commerce-web-api-sg-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "setof-commerce"
            "Service"     = "setof-commerce-web-api"
            "Type"        = "custom"
        }
      ~ tags_all               = {
          ~ "Description" = "Security group for web-api ECS tasks" -> "Security group for web-api ECS tasks - VPC internal only"
            # (10 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "default" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group-rule/sgr-0792cfcdee1af65d2" -> (known after apply)
      ~ id                     = "sgr-0792cfcdee1af65d2" -> (known after apply)
      ~ security_group_id      = "sg-08a96a3c690096c70" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0792cfcdee1af65d2" -> (known after apply)
        tags                   = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "setof-commerce-web-api-sg-prod-default-egress"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "setof-commerce"
            "Service"     = "setof-commerce-web-api"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "custom" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:646886795421:security-group-rule/sgr-036c22a9c5754b8d7" -> (known after apply)
      + cidr_ipv4                    = "10.0.0.0/16" # forces replacement
      ~ description                  = "From ALB only" -> "Service Discovery - internal VPC communication"
      ~ id                           = "sgr-036c22a9c5754b8d7" -> (known after apply)
      - referenced_security_group_id = "sg-010616513328b5acc" -> null # forces replacement
      ~ security_group_id            = "sg-08a96a3c690096c70" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-036c22a9c5754b8d7" -> (known after apply)
        tags                         = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "setof-commerce-web-api-sg-prod-custom-ingress-0"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "setof-commerce"
            "Service"     = "setof-commerce-web-api"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
      - health_check_grace_period_seconds  = 180 -> null
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/setof-commerce-cluster-prod/setof-commerce-web-api-prod"
        name                               = "setof-commerce-web-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for setof-commerce-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "setof-commerce-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "setof-commerce"
            "Service"     = "setof-commerce-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/setof-commerce-web-api-prod:3" -> (known after apply)
        # (15 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "web-api" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/setof-commerce-web-api-tg-prod/6d8e92520bb23eb8" -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-08a96a3c690096c70",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/setof-commerce-web-api-prod:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/setof-commerce-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "setof-commerce-web-api-prod" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for setof-commerce-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "setof-commerce-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "setof-commerce"
            "Service"     = "setof-commerce-web-api"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
+ resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "setof-commerce-web-api-prod"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for setof-commerce-web-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for setof-commerce-web-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.web_api_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "setof-commerce-web-api-task-role-prod:setof-commerce-web-api-task-role-prod-adot-amp-access"
        name        = "setof-commerce-web-api-task-role-prod-adot-amp-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action    = [
                            "cloudwatch:PutMetricData",
                        ]
                        Condition = {
                            StringEquals = {
                                "cloudwatch:namespace" = "SetOfCommerce"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = "*"
                        Sid       = "CloudWatchMetricsAccess"
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::connectly-prod/otel-config/*" -> "arn:aws:s3:::prod-connectly/otel-config/*"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 10 to destroy.

Changes to Outputs:
- alb_arn             = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/setof-commerce-alb-prod/594f87ad7a24c4df" -> null
- alb_dns_name        = "setof-commerce-alb-prod-1330483282.ap-northeast-2.elb.amazonaws.com" -> null
~ fqdn                = "commerce.set-of.com" -> "web-api.connectly.local"
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/setof-commerce-web-api-prod:5" -> (known after apply)
~ url                 = "https://commerce.set-of.com" -> "http://web-api.connectly.local:8080"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecs-web-api-prod
  ```
Plan: 5 to add, 2 to change, 10 to destroy.

---
### 3. project: `setof-commerce-ecs-web-api-legacy-prod` dir: `terraform/ecs-web-api-legacy` workspace: `default`
**Plan Error**
```
the default workspace at path terraform/ecs-web-api-legacy is currently locked by another command that is running for this pull request.
Wait until the previous command is complete and try again
```

---
### Plan Summary

3 projects, 1 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```